tests/performance/tests/register_unregister_multiple/register_unregister_multiple.yaml
---
execution:
- concurrency: 1
  ramp-up: 0s
  iterations: 5
  scenario: register_unregister_multiple

scenarios:
  register_unregister_multiple:
    script: register_unregister_multiple.jmx

modules:
  server_local_monitoring:
    class : metrics_monitoring_inproc.Monitor

services:
  - module: shellexec
    prepare:
      - "curl -s -O https://s3.amazonaws.com/model-server/inputs/kitten.jpg"
      - "multi-model-server --start > /dev/null 2>&1"
      - "sleep 20s"
      - "curl -s -X POST http://localhost:8081/models?url=https://s3.amazonaws.com/model-server/model_archive_1.0/resnet-18.mar"
    post-process:
      - "multi-model-server --stop > /dev/null 2>&1"
      - "rm kitten.jpg"
  - module: server_local_monitoring
    ServerLocalClient:
      - interval: 1s
        logging : True
        metrics:
          - total_processes
          - sum_all_file_descriptors
          - frontend_memory_rss

reporting:
- module: passfail
  criteria:
    # Inbuilt Criteria
    - success of RegisterModel<${REG_SUCC}, stop as failed
    - success of ScaleUp<${SCL_UP_SUCC}, stop as failed
    - success of UnregisterModel<${UNREG_SUCC}, stop as failed
    - avg-rt of RegisterModel>${REG_RT}, stop as failed
    - avg-rt of ScaleUp>${SCL_UP_RT}, stop as failed
    - avg-rt of UnregisterModel>${UNREG_RT}, stop as failed
    # Custom Criteria
    - class: bzt.modules.monitoring.MonitoringCriteria
      subject: ServerLocalClient/total_processes
      condition: '>'
      threshold: ${TOTAL_PROCS}
      timeframe: 5s
      stop : true
      fail : true
    - class: bzt.modules.monitoring.MonitoringCriteria
      subject: ServerLocalClient/sum_all_file_descriptors
      condition: '>'
      threshold: ${TOTAL_FDS}
      timeframe: 5s
      stop : true
      fail : true
#    - class: bzt.modules.monitoring.MonitoringCriteria
#      subject: ServerLocalClient/frontend_memory_rss
#      condition: '>'
#      threshold: ${FRNTEND_MEM}
#      timeframe: 5s
#      stop : true
#      fail : true